In [1]:
import mysql.connector
from mysql.connector import Error
import pandas as pd
import os
import numpy as np

In [4]:
data=pd.read_excel("C:\\Users\\91868\\Desktop\\Hari Data science\\C7-20200526T134159Z-001\\project1\\Data_excel_after_missing_values.xlsx", keep_default_na=False, na_values = ['','#N/A', '#N/A N/A', '#NA', '-1.#IND', '-1.#QNAN', '-NaN', '-nan','1.#IND', '1.#QNAN', 'N/A', 'NULL', 'NaN', 'n/a', 'nan','null'])

In [5]:
data.shape

(14247, 70)

In [6]:
data.head()

,Unnamed: 0,Customer_Id,Classification,Region,Primary_industry,Product_purchased,No.of transactions,Revenue,Recent_transaction_in_days,Employees_Total,...,Product_55,Product_56,Product_57,Product_58,Product_6,Product_7,Product_8,Product_9,status,Revenue_P29
0,0,Customer_ID_1351,Diamond,APJ,Public Administration,12,30,2.852616e+06,639,0,...,0,0,0,0,1,0,0,0,1,1.132087e+06
1,1,Customer_ID_1526,Large-Existing,APJ,"Finance, Insurance, And Real Estate",13,23,1.512550e+05,456,239756,...,0,0,1,0,0,0,1,0,1,NaN
2,2,Customer_ID_1533,Gold,APJ,Public Administration,16,43,3.202815e+06,274,795,...,0,0,1,0,1,0,0,0,1,6.957714e+04
3,3,Customer_ID_1654,Diamond,EMEA,Public Administration,15,44,5.527933e+05,91,300,...,0,0,1,0,1,0,0,0,1,NaN
4,4,Customer_ID_1264,Gold,APJ,Manufacturing,3,3,0.000000e+00,183,8907,...,0,0,0,0,1,0,0,0,1,NaN

In [12]:
connection = mysql.connector.connect(host='127.0.0.1',user='root',password='admin')

In [13]:
print(connection)

<mysql.connector.connection.MySQLConnection object at 0x000001EEA7C6EC18>

In [14]:
connection.get_server_info()

'8.0.17'

In [15]:
mycursor = connection.cursor()

In [16]:
mycursor.execute("SHOW DATABASES")

for x in mycursor:
    print(x)

('information_schema',)
('mysql',)
('performance_schema',)
('project1',)
('sys',)

In [34]:
connection = mysql.connector.connect(host='127.0.0.1',user='root',password='admin',database = 'project1')

mycursor = connection.cursor()

In [31]:
mycursor.execute("SHOW tables")

for x in mycursor:
    print(x)

('data1',)
('data_after_missing_values',)

In [32]:
t1 = mycursor.execute("select * from data_after_missing_values")

In [33]:
t1

In [35]:
mycursor.execute(''' show columns from data_after_missing_values''')

In [36]:
mycursor.fetchall()

[('Customer_Id', 'varchar(20)', 'NO', 'PRI', None, ''),
 ('Classification', 'varchar(25)', 'NO', '', None, ''),
 ('Region', 'varchar(25)', 'NO', '', None, ''),
 ('Primary_industry', 'varchar(25)', 'NO', '', None, ''),
 ('Products_purchased', 'int(5)', 'NO', '', None, ''),
 ('No_of_transactions', 'int(10)', 'NO', '', None, '')]

In [39]:
fruits = ['mango','banana','apple']
drinks = ['thumsup','sprit','slice']
check = pd.DataFrame(list(zip(fruits, drinks)), columns =['fruits', 'drinks'])

print(check)

   fruits   drinks
0   mango  thumsup
1  banana    sprit
2   apple    slice

In [40]:
connection = mysql.connector.connect(host='127.0.0.1',user='root',password='admin')

mycursor = connection.cursor()

In [41]:
mycursor.execute("CREATE DATABASE check_db")

In [43]:
connection = mysql.connector.connect(host='127.0.0.1',user='root',password='admin',database = 'check_db')

mycursor = connection.cursor()

In [44]:
mycursor.execute("CREATE TABLE check1 (fruits VARCHAR(255), drinks VARCHAR(255))")

In [45]:
mycursor.execute('show tables')

In [46]:
mycursor.fetchall()

[('check1',)]

In [50]:
for row in check.itertuples():
    mycursor.execute(''' INSERT INTO TestDB.check1 (fruits, fruits) VALUES (?,?) ''', row.fruits, row.drinks)
connection.commit()

In [ ]:
check